<template>
  <div class="advantages">
    <div class="row">
      <div class="col-sm-6">
        <div class="advantages__item">
          <div v-html="icon_code"></div>
          <p class="advantages__text">
            Идеально сидят на ноге. Не натирают, не сползают. Комфортно в любой обуви
          </p>
        </div>
        <div class="advantages__item">
          <div v-html="icon_code"></div>
          <p class="advantages__text">
            В них не потеют и не пахнут ноги. Они не вызывают зуда.
            <br>Высшая степень гигиены
          </p>
        </div>
      </div>
      <div class="col-sm-6">
        <div class="advantages__item">
          <div v-html="icon_code"></div>
          <p class="advantages__text">
            Не дырявятся.
            <br>Не протираются.
            <br>Не садятся при стирке.
          </p>
        </div>
        <div class="advantages__item">
          <div v-html="icon_code"></div>
          <p class="advantages__text">
            Мягкая плюшевая подошва дает амортизацию. Максимальный комфорт.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Advantages',
  data: () => ({
    icon_code: `<svg class="advantages__img" xmlns="http://www.w3.org/2000/svg"
      viewBox="0 0 40 45.93" weight="46px" height="46px">
      <path d="M24.79 4.25A22.31 22.31 0 0 0 32 2.91a22.49 22.49 0 0 0-7.26-.54 22.4 22.4 0 0 0-7.21
      1.33 22.4 22.4 0 0 0 7.26.55zm7.68 7.59V5.2c-.42.17-.8.28-1 .36a30.36 30.36 0 0 1-6.51 1c-.71
      0-1.41.06-2.09.06a25.91 25.91 0 0 1-4.49-.35 3 3 0 0 1-.63-.12c.26 2.38.24 1.57.59 6.11.54 6.91-.16 8.62-2
      13.18l-.73 1.8c-2.54 6.2-4.99 7.66-10.38 9.76-2.34.89-3.12 2.8-2.86 4.2s1.68 2.44 3.74 2.44c5.19 0
      11.28-.06 17-.53 2.62-.21 3.75-2.16 5-5.37l-.85.28a25 25 0 0 1-4.33.52 49.64 49.64 0 0 1-8.46-.54 65
      65 0 0 0 8.31-1 22.46 22.46 0 0 0 3.92-1 5.54 5.54 0 0 0 2.61-1.54c.36-.9.74-1.81 1.2-2.7a21.31 21.31
      0 0 1 4.36-5.48c1.8-1.78 2.82-2.86 2.82-4.47 0-1.41-1-2.49-2.13-3.75-1.45-1.51-3.09-3.31-3.09-6.22z"
      fill="#00feac"></path>
      <path d="M34.78 11.84V2.78C34.68 1 32 .5 31.14.35a29.47 29.47 0 0 0-6.58-.29 29.75 29.75 0 0 0-6.51
      1c-.85.25-3.44 1-3.34 2.8 0 0 1.14 6.12 1.29 8.58.49 6.36-.06 7.7-1.86 12.12l-.74 1.82c-2.17 5.42-4
      6.5-9 8.43C1.34 36-.43 38.77.09 41.59c.49 2.63 2.85 4.34 6 4.34 5.24 0 11.38-.07 17.21-.54 4.59-.37
      6-4.34 7.45-8.17a36.68 36.68 0 0 1 1.8-4.31A19.29 19.29 0 0 1 36.5 28c1.8-1.77 3.5-3.45 3.5-6.11
      0-2.31-1.45-3.9-2.73-5.3s-2.49-2.74-2.49-4.75zM24.69 2.37a22.49 22.49 0 0 1 7.31.54 22.31 22.31 0 0
      1-7.16 1.34 22.4 22.4 0 0 1-7.26-.55 22.4 22.4 0 0 1 7.11-1.33zm10.18 24a21.31 21.31 0 0 0-4.36
      5.48c-.46.89-.84 1.8-1.2 2.7a5.54 5.54 0 0 1-2.61 1.54 22.46 22.46 0 0 1-3.92 1 65 65 0 0 1-8.31.91
      49.64 49.64 0 0 0 8.46.56 25 25 0 0 0 4.33-.56l.85-.28c-1.23 3.21-2.36 5.16-5 5.37-5.74.47-11.83.53-17
      .53-2.06 0-3.46-.91-3.74-2.44s.52-3.31 2.86-4.2c5.39-2.07 7.84-3.53 10.32-9.73l.73-1.8c1.86-4.56 2.56-6.27
      2-13.18-.28-4.55-.28-3.74-.57-6.12a3 3 0 0 0 .63.12 25.91 25.91 0 0 0 4.49.35c.68 0 1.38 0 2.09-.06a30.36
      30.36 0 0 0 6.51-1c.24-.08.62-.19 1-.36v6.64c0 2.91 1.64 4.71 3.09 6.3 1.14 1.26 2.13 2.34 2.13 3.75.04
      1.61-.98 2.69-2.78 4.47z" fill="#141313"></path> </svg>`,
  }),
};
</script>

<style lang="scss">
@import "~@/assets/sass/shared";

.advantages {
  &__item {
    margin-bottom: 30px;
    @media (max-width: 991px) and (min-width: 768px) {
      margin-bottom: 15px;
    }
    @media (max-width: 767px) {
      width: 260px;
      margin: 0 auto;
    }
  }

  &__img {
    float: left;
    margin-right: 10px;
  }

  &__text {
    color: #737373;
    font-size: 14px;
    @media (max-width: 991px) and (min-width: 768px) {
      font-size: 12px;
    }
    @media (max-width: 767px) {
      text-align: left;
      font-size: 12px;
    }
  }
}
</style>
